In [1]:
import pandas as pd
df=pd.read_csv(r"C:\Users\KIIT\Downloads\salaries.csv")

In [2]:
df.sample(5)

       company                  job     degree  salary_more_then_100k
3       google     business manager    masters                      1
7   abc pharma  computer programmer  bachelors                      0
5       google  computer programmer    masters                      1
12    facebook     business manager  bachelors                      1
2       google     business manager  bachelors                      1

In [3]:
input=df.iloc[:,0:-1]
target=df.drop(columns=['salary_more_then_100k'])

In [4]:
columns=['company','job','degree']

In [5]:
df=pd.get_dummies(df,columns,dtype='int')

In [6]:
df.head()

,salary_more_then_100k,company_abc pharma,company_facebook,company_google,job_business manager,job_computer programmer,job_sales executive,degree_bachelors,degree_masters
0,0,0,0,1,0,0,1,1,0
1,0,0,0,1,0,0,1,0,1
2,1,0,0,1,1,0,0,1,0
3,1,0,0,1,1,0,0,0,1
4,0,0,0,1,0,1,0,1,0

In [7]:
inputs=df.drop(columns=['salary_more_then_100k'])
output=df['sa

In [8]:
from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier
X_train,X_test,y_train,y_test=train_test_split(inputs,output,test_size=0.2,random_state=42)

In [25]:
from sklearn.model_selection import RandomizedSearchCV

SyntaxError: invalid syntax. Perhaps you forgot a comma? (2473043915.py, line 2)